soa/PeopleSoftUpgrade/SyncEmployee/SynchEmployeeEbizProvABCS/public_html/EmployeeABM.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                <soap:Body xmlns:ns1="http://xmlns.officedepot.com/ApplicationMessage/HR/Custom/ABM/SyncEmployeeABM/V1">
<SyncEmployeeABM 
xmlns="http://xmlns.officedepot.com/ApplicationMessage/HR/Custom/ABM/SyncEmployeeABM/V1">
   <EmployeeHeader>
      <BatchID>383</BatchID>
      <ChunkID>384</ChunkID>
      <CreationDateTime>2012-06-12T20:36:26.750</CreationDateTime>
   </EmployeeHeader>
   <EmployeeDetails>
      <EmployeeID>385</EmployeeID>
      <BadgeNumber>386</BadgeNumber>
      <FirstName>FirstName387</FirstName>
      <MiddleName>MiddleName388</MiddleName>
      <LastName>LastName389</LastName>
      <SecondLastName>SecondLastName390</SecondLastName>
      <NamePrefix>NamePrefix391</NamePrefix>
      <NameSuffix>NameSuffix392</NameSuffix>
      <CommonName>CommonName393</CommonName>
      <Gender>Gender394</Gender>
      <BirthDate>1212</BirthDate>
      <NationalID>396</NationalID>
      <ODAddressEffectiveDate>2012-06-12T20:32:20.906</ODAddressEffectiveDate>
      <Address1>Address1398</Address1>
      <Address2>Address2399</Address2>
      <Address3>Address3400</Address3>
      <City>City401</City>
      <PostalCode>402</PostalCode>
      <County>County403</County>
      <State>State404</State>
      <Country>Country405</Country>
      <PerOrg>406</PerOrg>
      <EmployementStatus>EmployementStatus407</EmployementStatus>
      <ODJobEffectiveDate>2012-06-12T20:32:20.906</ODJobEffectiveDate>
      <HireDate>2012-06-12T20:32:20.906</HireDate>
      <Action>Action410</Action>
      <SetIDJobCode>SetIDJobCode411</SetIDJobCode>
      <JobCode>JobCode412</JobCode>
      <JobCodeDescription>JobCodeDescription413</JobCodeDescription>
      <BusinessUnit>BusinessUnit414</BusinessUnit>
      <SetIDLocation>SetIDLocation415</SetIDLocation>
      <SetIDSalary>15</SetIDSalary>
      <Location>Location416</Location>
      <Company>Company417</Company>
      <SetIDDepartment>SetIDDepartment418</SetIDDepartment>
      <DepartmentID>419</DepartmentID>
      <DepartmentName>DepartmentName420</DepartmentName>
      <RegulatoryRegion>RegulatoryRegion421</RegulatoryRegion>
      <CostCenter>CostCenter422</CostCenter>
      <TerminationDate>2012-06-12T20:32:20.906</TerminationDate>
      <LastWorkedDate>2012-06-12T20:32:20.906</LastWorkedDate>
      <Grade>Grade425</Grade>
      <SalaryAdminPlan>SalaryAdminPlan426</SalaryAdminPlan>
      <SupervisorID>427</SupervisorID>
      <ManagerLevel>ManagerLevel428</ManagerLevel>
      <JobEntryDate>2012-06-12T20:32:20.906</JobEntryDate>
      <JobFunction>JobFunction430</JobFunction>
      <JobDescription>JobDescription431</JobDescription>
      <ODBonusCode>ODBonusCode432</ODBonusCode>
      <ODExtendedOEE>ODExtendedOEE433</ODExtendedOEE>
      <ODMailCode>ODMailCode434</ODMailCode>
      <EmailID>EmailID435</EmailID>
      <VendorID>436</VendorID>
      <ODPhoneBusiness>ODPhoneBusiness437</ODPhoneBusiness>
      <PreferencePhoneBusinessFlag>1</PreferencePhoneBusinessFlag>
      <ODPhoneFaxPersonal>ODPhoneFaxPersonal439</ODPhoneFaxPersonal>
      <PreferencePhoneFaxFlag>1</PreferencePhoneFaxFlag>      
      <ODPhoneMain>ODPhoneMain440</ODPhoneMain>
      <PreferencePhoneMainFlag>1</PreferencePhoneMainFlag>
      <ODPhoneMobileBusiness>ODPhoneMobileBusiness442</ODPhoneMobileBusiness>
      <PreferencePhoneMobileBusinessFlag>1</PreferencePhoneMobileBusinessFlag>
      <ODPhoneMobilePersonal>ODPhoneMobilePersonal444</ODPhoneMobilePersonal>
      <PreferencePhoneMobilePersonalFlag>1</PreferencePhoneMobilePersonalFlag>
      <ODPhonePager>ODPhonePager446</ODPhonePager>
      <PreferencePhonePagerFlag>1</PreferencePhonePagerFlag>
   </EmployeeDetails>
   <EmployeeDetails>
      <EmployeeID>448</EmployeeID>
      <BadgeNumber>449</BadgeNumber>
      <FirstName>FirstName450</FirstName>
      <MiddleName>MiddleName451</MiddleName>
      <LastName>LastName452</LastName>
      <SecondLastName>SecondLastName453</SecondLastName>
      <NamePrefix>NamePrefix454</NamePrefix>
      <NameSuffix>NameSuffix455</NameSuffix>
      <CommonName>CommonName456</CommonName>
      <Gender>Gender457</Gender>
      <BirthDate>1212</BirthDate>
      <NationalID>459</NationalID>
      <ODAddressEffectiveDate>2012-06-12T20:32:20.906</ODAddressEffectiveDate>
     <Address1>Address1461</Address1>
      <Address2>Address2462</Address2>
      <Address3>Address3463</Address3>
      <City>City464</City>
      <PostalCode>465</PostalCode>
      <County>County466</County>
      <State>State467</State>
      <Country>Country468</Country>
      <PerOrg>469</PerOrg>
      <EmployementStatus>EmployementStatus470</EmployementStatus>
      <ODJobEffectiveDate>2012-06-12T20:32:20.906</ODJobEffectiveDate>
      <HireDate>2012-06-12T20:32:20.906</HireDate>
      <Action>Action473</Action>
      <SetIDJobCode>SetIDJobCode474</SetIDJobCode>
      <JobCode>JobCode475</JobCode>
      <JobCodeDescription>JobCodeDescription476</JobCodeDescription>
      <BusinessUnit>BusinessUnit477</BusinessUnit>
      <SetIDLocation>SetIDLocation478</SetIDLocation>
      <SetIDSalary>15</SetIDSalary>
      <Location>Location479</Location>
      <Company>Company480</Company>
      <SetIDDepartment>SetIDDepartment481</SetIDDepartment>
      <DepartmentID>482</DepartmentID>
      <DepartmentName>DepartmentName483</DepartmentName>
      <RegulatoryRegion>RegulatoryRegion484</RegulatoryRegion>
      <CostCenter>CostCenter485</CostCenter>
      <TerminationDate>2012-06-12T20:32:20.906</TerminationDate>
      <LastWorkedDate>2012-06-12T20:32:20.906</LastWorkedDate>
      <Grade>Grade488</Grade>
      <SalaryAdminPlan>SalaryAdminPlan489</SalaryAdminPlan>
      <SupervisorID>490</SupervisorID>
      <ManagerLevel>ManagerLevel491</ManagerLevel>
      <JobEntryDate>2012-06-12T20:32:20.906</JobEntryDate>
      <JobFunction>JobFunction493</JobFunction>
      <JobDescription>JobDescription494</JobDescription>
      <ODBonusCode>ODBonusCode495</ODBonusCode>
      <ODExtendedOEE>ODExtendedOEE496</ODExtendedOEE>
      <ODMailCode>ODMailCode497</ODMailCode>
      <EmailID>EmailID498</EmailID>
      <VendorID>499</VendorID>
      <ODPhoneBusiness>ODPhoneBusiness563</ODPhoneBusiness>
      <PreferencePhoneBusinessFlag>1</PreferencePhoneBusinessFlag>
      <ODPhoneFaxPersonal>ODPhoneFaxPersonal439</ODPhoneFaxPersonal>
      <PreferencePhoneFaxFlag>1</PreferencePhoneFaxFlag>       
      <ODPhoneMain>ODPhoneMain503</ODPhoneMain>
      <PreferencePhoneMainFlag>PreferencePhoneMainFlag504</PreferencePhoneMainFlag>
      <ODPhoneMobileBusiness>ODPhoneMobileBusiness505</ODPhoneMobileBusiness>
      <PreferencePhoneMobileBusinessFlag>PreferencePhoneMobileBusinessFlag506</PreferencePhoneMobileBusinessFlag>
      <ODPhoneMobilePersonal>ODPhoneMobilePersonal507</ODPhoneMobilePersonal>
      <PreferencePhoneMobilePersonalFlag>PreferencePhoneMobilePersonalFlag508</PreferencePhoneMobilePersonalFlag>
      <ODPhonePager>ODPhonePager509</ODPhonePager>
      <PreferencePhonePagerFlag>PreferencePhonePagerFlag510</PreferencePhonePagerFlag>
   </EmployeeDetails>
   <EmployeeDetails>
      <EmployeeID>511</EmployeeID>
      <BadgeNumber>512</BadgeNumber>
      <FirstName>FirstName513</FirstName>
      <MiddleName>MiddleName514</MiddleName>
      <LastName>LastName515</LastName>
      <SecondLastName>SecondLastName516</SecondLastName>
      <NamePrefix>NamePrefix517</NamePrefix>
      <NameSuffix>NameSuffix518</NameSuffix>
      <CommonName>CommonName519</CommonName>
      <Gender>Gender520</Gender>
      <BirthDate>1212</BirthDate>
      <NationalID>522</NationalID>
      <ODAddressEffectiveDate>2012-06-12T20:32:20.906</ODAddressEffectiveDate>
      <Address1>Address1524</Address1>
      <Address2>Address2525</Address2>
      <Address3>Address3526</Address3>
      <City>City527</City>
      <PostalCode>528</PostalCode>
      <County>County529</County>
      <State>State530</State>
      <Country>Country531</Country>
      <PerOrg>532</PerOrg>
      <EmployementStatus>EmployementStatus533</EmployementStatus>
      <ODJobEffectiveDate>2012-06-12T20:32:20.906</ODJobEffectiveDate>
      <HireDate>2012-06-12T20:32:20.906</HireDate>
      <Action>Action536</Action>
      <SetIDJobCode>SetIDJobCode537</SetIDJobCode>
      <JobCode>JobCode538</JobCode>
      <JobCodeDescription>JobCodeDescription539</JobCodeDescription>
      <BusinessUnit>BusinessUnit540</BusinessUnit>
      <SetIDLocation>SetIDLocation541</SetIDLocation>
      <SetIDSalary>15</SetIDSalary>
      <Location>Location542</Location>
      <Company>Company543</Company>
      <SetIDDepartment>SetIDDepartment544</SetIDDepartment>
      <DepartmentID>545</DepartmentID>
      <DepartmentName>DepartmentName546</DepartmentName>
      <RegulatoryRegion>RegulatoryRegion547</RegulatoryRegion>
      <CostCenter>CostCenter548</CostCenter>
      <TerminationDate>2012-06-12T20:32:20.906</TerminationDate>
      <LastWorkedDate>2012-06-12T20:32:20.906</LastWorkedDate>
      <Grade>Grade551</Grade>
      <SalaryAdminPlan>SalaryAdminPlan552</SalaryAdminPlan>
      <SupervisorID>553</SupervisorID>
      <ManagerLevel>ManagerLevel554</ManagerLevel>
      <JobEntryDate>2012-06-12T20:32:20.906</JobEntryDate>
      <JobFunction>JobFunction556</JobFunction>
      <JobDescription>JobDescription557</JobDescription>
      <ODBonusCode>ODBonusCode558</ODBonusCode>
      <ODExtendedOEE>ODExtendedOEE559</ODExtendedOEE>
      <ODMailCode>ODMailCode560</ODMailCode>
      <EmailID>EmailID561</EmailID>
      <VendorID>562</VendorID>
      <ODPhoneBusiness>ODPhoneBusiness563</ODPhoneBusiness>
      <PreferencePhoneBusinessFlag>1</PreferencePhoneBusinessFlag>
      <ODPhoneFaxPersonal>ODPhoneFaxPersonal439</ODPhoneFaxPersonal>
      <PreferencePhoneFaxFlag>1</PreferencePhoneFaxFlag> 
      <ODPhoneMain>ODPhoneMain566</ODPhoneMain>
      <PreferencePhoneMainFlag>PreferencePhoneMainFlag567</PreferencePhoneMainFlag>
      <ODPhoneMobileBusiness>ODPhoneMobileBusiness568</ODPhoneMobileBusiness>
      <PreferencePhoneMobileBusinessFlag>PreferencePhoneMobileBusinessFlag569</PreferencePhoneMobileBusinessFlag>
      <ODPhoneMobilePersonal>ODPhoneMobilePersonal570</ODPhoneMobilePersonal>
      <PreferencePhoneMobilePersonalFlag>PreferencePhoneMobilePersonalFlag571</PreferencePhoneMobilePersonalFlag>
      <ODPhonePager>ODPhonePager572</ODPhonePager>
      <PreferencePhonePagerFlag>PreferencePhonePagerFlag573</PreferencePhonePagerFlag>
   </EmployeeDetails>
</SyncEmployeeABM>    </soap:Body>
</soap:Envelope>
